Repository: starcat-app/Starcat
Catalog: Starcat/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, id, it, ja, ko, nl, pl, pt_br, ru, tr, uk, vi, zh_hans, zh_hant

# settings.ai.discoveredModels.empty
source: No models yet. Tap "Test", or use a custom model name in the defaults.
ar: لا توجد نماذج بعد. اضغط "اختبار"، أو استخدم اسم نموذج مخصص في الإعدادات الافتراضية.
de: Noch keine Modelle. Tippe auf „Testen“ oder verwende einen benutzerdefinierten Modellnamen in den Voreinstellungen.
es: Aún no hay modelos. Pulsa "Probar" o usa un nombre de modelo personalizado en los valores predeterminados.
fr: Aucun modèle pour l'instant. Appuyez sur "Tester" ou utilisez un nom de modèle personnalisé dans les valeurs par défaut.
id: Belum ada model. Ketuk "Uji", atau gunakan nama model kustom di default.
it: Nessun modello ancora. Tocca "Test" o usa un nome di modello personalizzato nei valori predefiniti.
ja: まだモデルがありません。「テスト」をタップするか、デフォルトでカスタムモデル名を使用してください。
ko: 아직 모델이 없습니다. "테스트"를 탭하거나 기본값에 사용자 정의 모델 이름을 사용하세요.
nl: Nog geen modellen. Tik op 'Test' of gebruik een aangepaste modelnaam in de standaardwaarden.
pl: Brak modeli. Naciśnij „Testuj” lub użyj niestandardowej nazwy modelu w ustawieniach domyślnych.
pt_br: Nenhum modelo ainda. Toque em "Testar" ou use um nome de modelo personalizado nas preferências.
ru: Моделей пока нет. Нажмите «Тест» или укажите имя модели в настройках по умолчанию.
tr: Henüz model yok. "Test"e dokunun veya varsayılanlarda özel bir model adı kullanın.
uk: Моделей ще немає. Натисніть "Тест" або введіть назву користувацької моделі в налаштуваннях за замовчуванням.
vi: Chưa có mô hình nào. Nhấn "Kiểm tra" hoặc sử dụng tên mô hình tùy chỉnh trong mặc định.
zh_hans: 暂无模型。点击“测试”，或在默认设置中使用自定义模型名。
zh_hant: 尚無模型。點按「測試」，或在預設值中使用自訂模型名稱。

# settings.ai.discoveredModels.title
source: Models
ar: النماذج
de: Modelle
es: Modelos
fr: Modèles
id: Model
it: Modelli
ja: モデル
ko: 모델
nl: Modellen
pl: Modele
pt_br: Modelos
ru: Модели
tr: Modeller
uk: Моделі
vi: Mô hình
zh_hans: 模型
zh_hant: 模型

# settings.ai.locked.benefit.billing
source: Model usage is billed by your own provider account
ar: يتم إصدار فاتورة استخدام النموذج من حساب المزوّد الخاص بك
de: Modellnutzung wird über Ihr eigenes Anbieterkonto abgerechnet
es: El uso del modelo se factura a través de tu cuenta de proveedor
fr: L'utilisation du modèle est facturée par votre propre compte fournisseur
id: Penggunaan model ditagih oleh akun penyedia Anda sendiri
it: L'utilizzo del modello viene fatturato tramite il tuo account provider
ja: モデルの使用料金はお客様のプロバイダアカウントに請求されます
ko: 모델 사용은 자체 제공자 계정으로 청구됩니다
nl: Modelgebruik wordt gefactureerd via uw eigen provideraccount
pl: Użycie modelu jest rozliczane przez konto Twojego dostawcy
pt_br: O uso do modelo é cobrado pela sua própria conta do provedor
ru: Использование модели оплачивается через ваш собственный аккаунт провайдера
tr: Model kullanımı kendi sağlayıcı hesabınızdan faturalanır
uk: Використання моделі оплачується вашим власним обліковим записом постачальника
vi: Việc sử dụng mô hình được thanh toán qua tài khoản nhà cung cấp của bạn
zh_hans: 模型调用费用由你自己的服务商账户承担
zh_hant: 模型使用費用由你自己的服務商帳戶承擔

# settings.ai.locked.benefit.byok
source: Configure OpenAI-compatible providers with your own API keys
ar: قم بتهيئة مزوّدين متوافقين مع OpenAI باستخدام مفاتيح API الخاصة بك
de: OpenAI-kompatible Anbieter mit eigenen API-Schlüsseln konfigurieren
es: Configura proveedores compatibles con OpenAI con tus propias claves API
fr: Configurez des fournisseurs compatibles OpenAI avec vos propres clés API
id: Konfigurasikan penyedia yang kompatibel dengan OpenAI dengan kunci API Anda sendiri
it: Configura provider compatibili con OpenAI con le tue chiavi API
ja: 独自のAPIキーでOpenAI互換プロバイダを設定
ko: 자체 API 키로 OpenAI 호환 제공자 구성
nl: Configureer OpenAI-compatibele providers met uw eigen API-sleutels
pl: Skonfiguruj dostawców zgodnych z OpenAI z własnymi kluczami API
pt_br: Configure provedores compatíveis com OpenAI usando suas próprias chaves de API
ru: Настройте провайдеров, совместимых с OpenAI, с вашими API-ключами
tr: Kendi API anahtarlarınızla OpenAI uyumlu sağlayıcıları yapılandırın
uk: Налаштуйте сумісні з OpenAI постачальники з власними API-ключами
vi: Cấu hình nhà cung cấp tương thích OpenAI với khóa API của riêng bạn
zh_hans: 配置 OpenAI-compatible 服务商和自己的 API Key
zh_hant: 使用自己的 API Key 設定 OpenAI 相容的服務商

# settings.ai.locked.benefit.workflow
source: Unlock summaries, tags, chat, translation, semantic search, and batch cleanup
ar: افتح الملخصات، الوسوم، الدردشة، الترجمة، البحث الدلالي، والتنظيف الدفعي
de: Schalte Zusammenfassungen, Tags, Chat, Übersetzung, semantische Suche und Batch-Bereinigung frei
es: Desbloquea resúmenes, etiquetas, chat, traducción, búsqueda semántica y limpieza por lotes
fr: Débloquez les résumés, tags, chat, traduction, recherche sémantique et nettoyage par lots
id: Buka kunci ringkasan, tag, obrolan, terjemahan, pencarian semantik, dan pembersihan batch
it: Sblocca riepiloghi, tag, chat, traduzione, ricerca semantica e pulizia batch
ja: 要約、タグ、チャット、翻訳、セマンティック検索、一括クリーンアップを利用可能
ko: 요약, 태그, 채팅, 번역, 의미 검색 및 일괄 정리 잠금 해제
nl: Ontgrendel samenvattingen, tags, chat, vertaling, semantisch zoeken en batch-opschoning
pl: Odblokuj podsumowania, tagi, czat, tłumaczenie, wyszukiwanie semantyczne i czyszczenie zbiorcze
pt_br: Desbloqueie resumos, tags, chat, tradução, busca semântica e limpeza em lote
ru: Откройте сводки, теги, чат, перевод, смысловой поиск и пакетную очистку
tr: Özetler, etiketler, sohbet, çeviri, anlamsal arama ve toplu temizliğin kilidini açın
uk: Розблокуйте підсумки, теги, чат, переклад, семантичний пошук і пакетне очищення
vi: Mở khóa tóm tắt, thẻ, trò chuyện, dịch thuật, tìm kiếm ngữ nghĩa và dọn dẹp hàng loạt
zh_hans: 解锁摘要、标签、对话、翻译、语义搜索与批量整理
zh_hant: 解鎖摘要、標籤、對話、翻譯、語義搜尋與批次整理

# settings.ai.locked.footer
source: Starcat Pro unlocks the AI workflow layer. Your API keys remain local and are never sent to Starcat servers.
ar: Starcat Pro يفتح طبقة سير عمل الذكاء الاصطناعي. تبقى مفاتيح API الخاصة بك محلية ولا تُرسل أبداً إلى خوادم Starcat.
de: Starcat Pro schaltet die KI-Workflow-Ebene frei. Ihre API-Schlüssel bleiben lokal und werden nie an Starcat-Server gesendet.
es: Starcat Pro desbloquea la capa de flujo de trabajo de IA. Tus claves API permanecen locales y nunca se envían a los servidores de Starcat.
fr: Starcat Pro déverrouille la couche de workflow IA. Vos clés API restent locales et ne sont jamais envoyées aux serveurs Starcat.
id: Starcat Pro membuka lapisan alur kerja AI. Kunci API Anda tetap lokal dan tidak pernah dikirim ke server Starcat.
it: Starcat Pro sblocca il livello dei flussi di lavoro AI. Le tue chiavi API rimangono locali e non vengono mai inviate ai server Starcat.
ja: Starcat ProでAIワークフローレイヤーを解放。APIキーはローカルに保持され、Starcatサーバーに送信されることはありません。
ko: Starcat Pro는 AI 워크플로 레이어를 잠금 해제합니다. API 키는 로컬에 유지되며 Starcat 서버로 전송되지 않습니다.
nl: Starcat Pro ontgrendelt de AI-workflowlaag. Uw API-sleutels blijven lokaal en worden nooit naar Starcat-servers verzonden.
pl: Starcat Pro odblokowuje warstwę przepływu pracy AI. Twoje klucze API pozostają lokalne i nigdy nie są wysyłane na serwery Starcat.
pt_br: O Starcat Pro desbloqueia a camada de fluxo de trabalho de IA. Suas chaves de API permanecem locais e nunca são enviadas aos servidores do Starcat.
ru: Starcat Pro открывает уровень AI-рабочих процессов. Ваши API-ключи остаются локальными и никогда не отправляются на серверы Starcat.
tr: Starcat Pro, AI iş akışı katmanının kilidini açar. API anahtarlarınız yerel kalır ve asla Starcat sunucularına gönderilmez.
uk: Starcat Pro розблоковує рівень AI-робочих процесів. Ваші API-ключі залишаються локальними та ніколи не надсилаються на сервери Starcat.
vi: Starcat Pro mở khóa lớp quy trình AI. Khóa API của bạn vẫn ở cục bộ và không bao giờ được gửi đến máy chủ Starcat.
zh_hans: Starcat Pro 解锁 AI 工作流层；你的 API Key 仍只保存在本机，不会发送到 Starcat 服务器。
zh_hant: Starcat Pro 解鎖 AI 工作流程層；你的 API Key 仍只保存在本機，不會傳送至 Starcat 伺服器。

# settings.ai.locked.paywallMessage
source: AI service configuration and BYOK workflows require Starcat Pro.
ar: تهيئة خدمة الذكاء الاصطناعي وسير عمل BYOK تتطلب Starcat Pro.
de: KI-Dienstkonfiguration und BYOK-Workflows erfordern Starcat Pro.
es: La configuración del servicio de IA y los flujos de trabajo BYOK requieren Starcat Pro.
fr: La configuration du service IA et les workflows BYOK nécessitent Starcat Pro.
id: Konfigurasi layanan AI dan alur kerja BYOK memerlukan Starcat Pro.
it: La configurazione del servizio AI e i flussi di lavoro BYOK richiedono Starcat Pro.
ja: AIサービスの設定とBYOKワークフローにはStarcat Proが必要です。
ko: AI 서비스 구성 및 BYOK 워크플로에는 Starcat Pro가 필요합니다.
nl: AI-serviceconfiguratie en BYOK-workflows vereisen Starcat Pro.
pl: Konfiguracja usług AI i przepływy pracy BYOK wymagają Starcat Pro.
pt_br: A configuração do serviço de IA e os fluxos de trabalho BYOK requerem o Starcat Pro.
ru: Настройка AI-сервисов и рабочие процессы BYOK требуют Starcat Pro.
tr: AI hizmet yapılandırması ve BYOK iş akışları Starcat Pro gerektirir.
uk: Налаштування AI-сервісу та робочі процеси BYOK потребують Starcat Pro.
vi: Cấu hình dịch vụ AI và quy trình BYOK yêu cầu Starcat Pro.
zh_hans: AI 服务配置与 BYOK 工作流需要 Starcat Pro。
zh_hant: AI 服務設定與 BYOK 工作流程需要 Starcat Pro。

# settings.ai.locked.subtitle
source: Bring your own key after upgrading. Pro unlocks Starcat's AI workflow layer; provider API costs still belong to your account.
ar: أحضر مفتاحك الخاص بعد الترقية. Pro يفتح طبقة سير عمل الذكاء الاصطناعي في Starcat؛ تكاليف API للمزوّد لا تزال على حسابك.
de: Bringen Sie nach dem Upgrade Ihren eigenen Schlüssel mit. Pro schaltet die KI-Workflow-Ebene von Starcat frei; die API-Kosten des Anbieters verbleiben auf Ihrem Konto.
es: Trae tu propia clave después de actualizar. Pro desbloquea la capa de flujo de trabajo de IA de Starcat; los costos de API del proveedor siguen siendo de tu cuenta.
fr: Apportez votre propre clé après la mise à niveau. Pro déverrouille la couche de workflow IA de Starcat ; les coûts API du fournisseur restent à votre charge.
id: Bawa kunci Anda sendiri setelah upgrade. Pro membuka lapisan alur kerja AI Starcat; biaya API penyedia tetap menjadi tanggungan akun Anda.
it: Porta la tua chiave dopo l'aggiornamento. Pro sblocca il livello dei flussi di lavoro AI di Starcat; i costi API del provider rimangono a carico del tuo account.
ja: アップグレード後に独自のキーを持ち込めます。ProでStarcatのAIワークフローレイヤーが解放されます。プロバイダのAPI費用はお客様のアカウントに請求されます。
ko: 업그레이드 후 자체 키를 가져오세요. Pro는 Starcat의 AI 워크플로 레이어를 잠금 해제합니다. 제공자 API 비용은 귀하의 계정에 부과됩니다.
nl: Neem uw eigen sleutel mee na upgraden. Pro ontgrendelt de AI-workflowlaag van Starcat; provider-API-kosten blijven voor uw rekening.
pl: Przynieś własny klucz po aktualizacji. Pro odblokowuje warstwę przepływu pracy AI Starcat; koszty API dostawcy nadal obciążają Twoje konto.
pt_br: Traga sua própria chave após a atualização. O Pro desbloqueia a camada de fluxo de trabalho de IA do Starcat; os custos da API do provedor ainda pertencem à sua conta.
ru: Принесите свой ключ после обновления. Pro открывает уровень AI-рабочих процессов Starcat; затраты на API провайдера остаются на вашем аккаунте.
tr: Yükseltmeden sonra kendi anahtarınızı getirin. Pro, Starcat'ın AI iş akışı katmanının kilidini açar; sağlayıcı API maliyetleri yine hesabınıza aittir.
uk: Принесіть власний ключ після оновлення. Pro розблоковує рівень AI-робочих процесів Starcat; витрати на API постачальника все ще належать вашому обліковому запису.
vi: Mang khóa của bạn sau khi nâng cấp. Pro mở khóa lớp quy trình AI của Starcat; chi phí API của nhà cung cấp vẫn thuộc tài khoản của bạn.
zh_hans: 升级后即可使用自己的 Key。Pro 解锁 Starcat 的 AI 工作流层，服务商 API 费用仍由你的账户承担。
zh_hant: 升級後即可使用自己的 Key。Pro 解鎖 Starcat 的 AI 工作流程層，服務商 API 費用仍由你的帳戶承擔。

# settings.ai.locked.title
source: AI service is a Pro feature
ar: خدمة الذكاء الاصطناعي ميزة Pro
de: KI-Dienst ist eine Pro-Funktion
es: El servicio de IA es una función Pro
fr: Le service IA est une fonctionnalité Pro
id: Layanan AI adalah fitur Pro
it: Il servizio AI è una funzionalità Pro
ja: AIサービスはPro機能です
ko: AI 서비스는 Pro 기능입니다
nl: AI-service is een Pro-functie
pl: Usługa AI to funkcja Pro
pt_br: O serviço de IA é um recurso Pro
ru: AI-сервис — функция Pro
tr: AI hizmeti bir Pro özelliğidir
uk: AI-сервіс — це функція Pro
vi: Dịch vụ AI là tính năng Pro
zh_hans: AI 服务是 Pro 功能
zh_hant: AI 服務是 Pro 功能

# settings.ai.locked.upgrade
source: Upgrade to Pro
ar: الترقية إلى Pro
de: Auf Pro upgraden
es: Actualizar a Pro
fr: Passer à Pro
id: Tingkatkan ke Pro
it: Aggiorna a Pro
ja: Proにアップグレード
ko: Pro로 업그레이드
nl: Upgrade naar Pro
pl: Aktualizuj do Pro
pt_br: Atualizar para Pro
ru: Обновиться до Pro
tr: Pro'ya Yükselt
uk: Оновити до Pro
vi: Nâng cấp lên Pro
zh_hans: 升级到 Pro
zh_hant: 升級至 Pro

# settings.ai.modelList.empty
source: No matching models.
ar: لا توجد نماذج مطابقة.
de: Keine passenden Modelle.
es: No hay modelos que coincidan.
fr: Aucun modèle correspondant.
id: Tidak ada model yang cocok.
it: Nessun modello corrispondente.
ja: 一致するモデルがありません。
ko: 일치하는 모델이 없습니다.
nl: Geen overeenkomende modellen.
pl: Brak pasujących modeli.
pt_br: Nenhum modelo correspondente.
ru: Нет подходящих моделей.
tr: Eşleşen model yok.
uk: Немає відповідних моделей.
vi: Không có mô hình phù hợp.
zh_hans: 没有匹配的模型。
zh_hant: 沒有符合的模型。

# settings.ai.modelList.matchedFormat
source: %lld matched
ar: %lld مطابق
de: %lld passend
es: %lld coincidencias
fr: %lld correspondants
id: %lld cocok
it: %lld corrispondenti
ja: %lld件一致
ko: %lld개 일치
nl: %lld overeenkomsten
pl: Dopasowano %lld
pt_br: %lld correspondido(s)
ru: Найдено %lld
tr: %lld eşleşti
uk: %lld збігів
vi: %lld phù hợp
zh_hans: 匹配 %lld 个
zh_hant: 符合 %lld 個

# settings.ai.modelList.parametersHelp
source: Model parameters
ar: معاملات النموذج
de: Modellparameter
es: Parámetros del modelo
fr: Paramètres du modèle
id: Parameter model
it: Parametri del modello
ja: モデルパラメータ
ko: 모델 매개변수
pl: Parametry modelu
pt_br: Parâmetros do modelo
ru: Параметры модели
tr: Model parametreleri
uk: Параметри моделі
vi: Tham số mô hình
zh_hans: 模型参数
zh_hant: 模型參數

# settings.ai.modelList.searchPlaceholder
source: Filter by model name, owner or capability
ar: تصفية حسب اسم النموذج أو المالك أو الإمكانية
de: Nach Modellname, Besitzer oder Fähigkeit filtern
es: Filtrar por nombre, propietario o capacidad
fr: Filtrer par nom de modèle, propriétaire ou capacité
id: Filter berdasarkan nama model, pemilik, atau kemampuan
it: Filtra per nome del modello, proprietario o funzionalità
ja: モデル名、所有者、機能でフィルタ
ko: 모델 이름, 소유자 또는 기능으로 필터링
nl: Filteren op modelnaam, eigenaar of mogelijkheid
pl: Filtruj według nazwy modelu, właściciela lub możliwości
pt_br: Filtrar por nome do modelo, proprietário ou capacidade
ru: Фильтр по имени модели, владельцу или возможностям
tr: Model adı, sahibi veya yeteneğine göre filtrele
uk: Фільтр за назвою моделі, власником або можливостями
vi: Lọc theo tên mô hình, chủ sở hữu hoặc khả năng
zh_hans: 过滤模型名称、owner 或能力
zh_hant: 依模型名稱、擁有者或能力篩選

# settings.ai.modelList.totalFormat
source: %lld model(s)
ar: %lld نموذج
de: %lld Modell(e)
es: %lld modelo(s)
fr: %lld modèle(s)
id: %lld model
it: %lld modello(i)
ja: %lld個のモデル
ko: %lld개 모델
nl: %lld model(len)
pl: %lld model(i)
pt_br: %lld modelo(s)
ru: %lld модель(и)
tr: %lld model
uk: %lld моделі(ей)
vi: %lld mô hình
zh_hans: %lld 个模型
zh_hant: %lld 個模型

# settings.ai.modelParams.contextWindow
source: Context window
ar: نافذة السياق
de: Kontextfenster
es: Ventana de contexto
fr: Fenêtre de contexte
id: Jendela konteks
it: Finestra di contesto
ja: コンテキストウィンドウ
ko: 컨텍스트 창
nl: Contextvenster
pl: Okno kontekstu
pt_br: Janela de contexto
ru: Контекстное окно
tr: Bağlam penceresi
uk: Контекстне вікно
vi: Cửa sổ ngữ cảnh
zh_hans: 上下文窗口
zh_hant: 上下文視窗

# settings.ai.modelParams.maxTokens
source: Max tokens
ar: الحد الأقصى للرموز
de: Maximale Token
es: Máx. tokens
fr: Nombre max. de tokens
id: Token maksimal
it: Token massimi
ja: 最大トークン数
ko: 최대 토큰
pl: Maksymalna liczba tokenów
pt_br: Tokens máximos
ru: Макс. токенов
tr: Maksimum token
uk: Макс. токенів
vi: Số token tối đa
zh_hans: 最大 Token
zh_hant: 最大 Token

# settings.ai.modelParams.overridden
source: Overridden
ar: تم التجاوز
de: Überschrieben
es: Anulado
fr: Remplacé
id: Ditimpa
it: Sostituito
ja: 上書き済み
ko: 재정의됨
nl: Overschreven
pl: Nadpisane
pt_br: Substituído
ru: Переопределено
tr: Geçersiz kılındı
uk: Перевизначено
vi: Đã ghi đè
zh_hans: 已自定义
zh_hant: 已覆寫

# settings.ai.modelParams.resetDefault
source: Reset to default
ar: إعادة التعيين إلى الافتراضي
de: Auf Standard zurücksetzen
es: Restablecer valores predeterminados
fr: Réinitialiser aux valeurs par défaut
id: Kembalikan ke default
it: Ripristina predefiniti
ja: デフォルトにリセット
ko: 기본값으로 재설정
nl: Standaard herstellen
pl: Przywróć domyślne
pt_br: Redefinir para o padrão
ru: Сбросить на умолчание
tr: Varsayılana sıfırla
uk: Скинути до стандартних
vi: Đặt lại về mặc định
zh_hans: 重置默认
zh_hant: 重設為預設值

# settings.ai.modelParams.resetHelp.activeFormat
source: Clear this model's parameter overrides; next call uses %@ defaults
ar: مسح تجاوزات معاملات هذا النموذج؛ المكالمة التالية تستخدم الإعدادات الافتراضية لـ %@
de: Parameterüberschreibungen dieses Modells löschen; nächster Aufruf verwendet %@-Standardwerte
es: Borrar las anulaciones de parámetros de este modelo; la próxima llamada usará los valores predeterminados de %@
fr: Effacer les remplacements de paramètres de ce modèle ; le prochain appel utilise les valeurs par défaut de %@
id: Hapus pengaturan parameter model ini; panggilan berikutnya menggunakan default %@
it: Cancella le sostituzioni dei parametri di questo modello; la prossima chiamata usa i valori predefiniti di %@
ja: このモデルのパラメータ上書きをクリア。次回の呼び出しでは%@のデフォルトが使用されます。
ko: 이 모델의 매개변수 재정의를 지웁니다. 다음 호출 시 %@ 기본값을 사용합니다.
nl: Wis de parameteroverschrijvingen van dit model; volgende aanroep gebruikt %@ standaardwaarden
pl: Wyczyść nadpisania parametrów tego modelu; następne wywołanie użyje domyślnych %@
pt_br: Limpar as substituições de parâmetros deste modelo; a próxima chamada usará os padrões de %@
ru: Очистить переопределения параметров этой модели; следующий вызов использует значения по умолчанию %@
tr: Bu modelin parametre geçersiz kılmalarını temizle; sonraki çağrı %@ varsayılanlarını kullanır
uk: Очистити перевизначення параметрів цієї моделі; наступний виклик використовує стандартні %@
vi: Xóa các ghi đè tham số của mô hình này; lần gọi tiếp theo sẽ sử dụng mặc định của %@
zh_hans: 清除该模型的参数覆盖，下次调用回到 %@ 默认值
zh_hant: 清除此模型的參數覆寫；下次呼叫將使用 %@ 預設值

# settings.ai.modelParams.resetHelp.activeFormat %@
source: Reset %@ parameters
ar: إعادة تعيين معاملات %@
de: %@ Parameter zurücksetzen
es: Restablecer parámetros de %@
fr: Réinitialiser les paramètres de %@
id: Setel ulang parameter %@
it: Ripristina parametri %@
ja: %@のパラメータをリセット
ko: %@ 매개변수 재설정
nl: %@ parameters herstellen
pl: Resetuj parametry %@
pt_br: Redefinir parâmetros de %@
ru: Сбросить параметры %@
tr: %@ parametrelerini sıfırla
uk: Скинути параметри %@
vi: Đặt lại tham số %@
zh_hans: 重置 %@ 参数
zh_hant: 重設 %@ 參數

# settings.ai.modelParams.resetHelp.empty
source: No overrides yet — nothing to reset
ar: لا توجد تجاوزات بعد — لا شيء لإعادة التعيين
de: Noch keine Überschreibungen – nichts zurückzusetzen
es: Aún no hay anulaciones, no hay nada que restablecer
fr: Aucun remplacement pour l'instant — rien à réinitialiser
id: Belum ada pengaturan — tidak ada yang perlu direset
it: Nessuna sostituzione ancora — nulla da ripristinare
ja: まだ上書きがありません — リセットするものはありません
ko: 아직 재정의가 없습니다 — 재설정할 항목이 없습니다.
nl: Nog geen overschrijvingen — niets om te herstellen
pl: Brak nadpisań – nic do resetowania
pt_br: Nenhuma substituição ainda — nada para redefinir
ru: Переопределений пока нет — нечего сбрасывать
tr: Henüz geçersiz kılma yok — sıfırlanacak bir şey yok
uk: Ще немає перевизначень — нічого скидати
vi: Chưa có ghi đè nào — không có gì để đặt lại
zh_hans: 尚无覆盖，无需重置
zh_hant: 尚無覆寫，無需重設

# settings.ai.modelParams.streamPreferred
source: Prefer streaming responses
ar: تفضيل الردود المتدفقة
de: Streaming-Antworten bevorzugen
es: Preferir respuestas en streaming
fr: Préférer les réponses en flux
id: Utamakan respons streaming
it: Preferisci risposte in streaming
ja: ストリーミング応答を優先
ko: 스트리밍 응답 선호
nl: Streamingreacties verkiezen
pl: Preferuj odpowiedzi strumieniowe
pt_br: Preferir respostas em streaming
ru: Предпочитать потоковые ответы
tr: Akış yanıtlarını tercih et
uk: Надавати перевагу потоковим відповідям
vi: Ưu tiên phản hồi dạng luồng
zh_hans: 优先使用流式响应
zh_hant: 偏好串流回應

# settings.ai.modelParams.timeout
source: Timeout
ar: المهلة
de: Zeitüberschreitung
es: Tiempo de espera
fr: Délai d'attente
id: Batas waktu
ja: タイムアウト
ko: 시간 초과
pl: Limit czasu
pt_br: Tempo limite
ru: Тайм-аут
tr: Zaman aşımı
uk: Час очікування
vi: Thời gian chờ
zh_hans: 超时时间
zh_hant: 逾時

# settings.ai.modelParams.unit.seconds
source: s
ar: ث
id: dt
ja: 秒
ko: 초
ru: с
uk: с
zh_hans: 秒
zh_hant: 秒
